# Library

In [6]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine

# Connection

In [9]:
conn = psycopg2.connect(
    host="127.0.0.1",
    port="5432",
    database="olist",
    user="postgres",
    password="0000"
)

In [10]:
engine = create_engine('postgresql+psycopg2://', creator=lambda: conn)

# Import Data

In [7]:
datageoloc = pd.read_csv('data/olist_geolocation_dataset.csv')

In [8]:
datageoloc.head()

,geolocation_zip_code_prefix,geolocation_lat,geolocation_lng,geolocation_city,geolocation_state
0,1037,-23.545621,-46.639292,sao paulo,SP
1,1046,-23.546081,-46.644820,sao paulo,SP
2,1046,-23.546129,-46.642951,sao paulo,SP
3,1041,-23.544392,-46.639499,sao paulo,SP
4,1035,-23.541578,-46.641607,sao paulo,SP

# Write in database

## State

In [11]:
table_name = 'olist_state'

In [18]:
state = pd.DataFrame(datageoloc['geolocation_state'].unique(), columns=['state_code'])

In [19]:
state

   state_code
0          SP
1          RN
2          AC
3          RJ
4          ES
5          MG
6          BA
7          SE
8          PE
9          AL
10         PB
11         CE
12         PI
13         MA
14         PA
15         AP
16         AM
17         RR
18         DF
19         GO
20         RO
21         TO
22         MT
23         MS
24         RS
25         PR
26         SC

In [16]:
state.to_sql(table_name, engine, if_exists='append', index=False)

AttributeError: 'numpy.ndarray' object has no attribute 'to_sql'

# Close the cursor and connection objects

In [ ]:
conn.commit()
cur.close()
conn.close()